<a href="https://colab.research.google.com/github/JakeOh/202011_itw_bd21/blob/main/lab_da/da15_reshape.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

# DataFrame 모양(shape) 변경

*   wide (column) -> long (row)
*   long (row) -> wide (column)

## stack/unstack

In [2]:
df = pd.DataFrame(data=np.arange(1, 7).reshape((2, 3)),
                  columns=['a', 'b', 'c'],
                  index=['A', 'B'])
df

   a  b  c
A  1  2  3
B  4  5  6

In [3]:
df_stacked = df.stack()
df_stacked

A  a    1
   b    2
   c    3
B  a    4
   b    5
   c    6
dtype: int64

In [4]:
df_unstacked = df_stacked.unstack()
df_unstacked

   a  b  c
A  1  2  3
B  4  5  6

In [5]:
df_unstacked2 = df_stacked.unstack(level=0)
df_unstacked2

   A  B
a  1  4
b  2  5
c  3  6

In [6]:
df = pd.DataFrame(data=np.arange(1, 13).reshape((2, 6)),
                  columns=[['A'] * 3 + ['B'] * 3,
                           ['a', 'b', 'c'] * 2])
df

   A         B
   a  b  c   a   b   c
0  1  2  3   4   5   6
1  7  8  9  10  11  12

In [7]:
df.stack()

     A   B
0 a  1   4
  b  2   5
  c  3   6
1 a  7  10
  b  8  11
  c  9  12

In [8]:
df.stack(level=0)

      a   b   c
0 A   1   2   3
  B   4   5   6
1 A   7   8   9
  B  10  11  12

## pivot/melt

In [9]:
df = pd.DataFrame(data={'A': ['one'] * 3 + ['two'] * 3,
                        'B': ['a', 'b', 'c'] * 2,
                        'C': np.arange(1, 7),
                        'D': np.arange(2, 13, 2)})
df

     A  B  C   D
0  one  a  1   2
1  one  b  2   4
2  one  c  3   6
3  two  a  4   8
4  two  b  5  10
5  two  c  6  12


`pivot()` 메서드의 parameter:

*   `index`: 원본 데이터 프레임을 pivotiong을 할 때, row index로 사용할 컬럼(들)의 이름(레이블)
*   `columns`: 원본 데이터 프레임을 pivoting을 할 때, column 이름(레이블)으로 사용할 컬럼(들)의 이름(레이블)
*   `values`: 원본 데이터 프레임을 pivoting을 할 때, 각 셀에 저장될 값으로 사용할 컬럼(들)의 이름(레이블)

In [10]:
pivoted1 = df.pivot(index='A',
                    columns='B',
                    values='C')
pivoted1

B    a  b  c
A
one  1  2  3
two  4  5  6

In [13]:
pivoted2 = df.pivot(index='A', columns='B', values='D')
pivoted2

B    a   b   c
A
one  2   4   6
two  8  10  12

In [15]:
df

     A  B  C   D
0  one  a  1   2
1  one  b  2   4
2  one  c  3   6
3  two  a  4   8
4  two  b  5  10
5  two  c  6  12

In [14]:
pivoted3 = df.pivot(index='A', columns='B', values=['C', 'D'])
pivoted3

     C        D
B    a  b  c  a   b   c
A
one  1  2  3  2   4   6
two  4  5  6  8  10  12

In [22]:
countries = ['Korea', 'Korea', 'China', 'China', 'GB', 'GB', 'US', 'US']
continents = ['Asia'] * 4 + ['Europe'] * 2 + ['America'] * 2
years = [2020, 2021] * 4

np.random.seed(1)
df = pd.DataFrame(data={'country': countries,
                        'continent': continents,
                        'year': years,
                        'pop': np.random.randint(10000, size=8),
                        'gdp': np.random.rand(8)})

In [23]:
df

  country continent  year   pop       gdp
0   Korea      Asia  2020   235  0.186260
1   Korea      Asia  2021  5192  0.345561
2   China      Asia  2020   905  0.396767
3   China      Asia  2021  7813  0.538817
4      GB    Europe  2020  2895  0.419195
5      GB    Europe  2021  5056  0.685220
6      US   America  2020   144  0.204452
7      US   America  2021  4225  0.878117

In [24]:
# 국가별 연도별 인구
df.pivot(index='country', columns='year', values='pop')

year     2020  2021
country
China     905  7813
GB       2895  5056
Korea     235  5192
US        144  4225

In [25]:
# 국가별 연도별 인구, GDP
df.pivot(index='country', columns='year', values=['pop', 'gdp'])

            pop               gdp
year       2020    2021      2020      2021
country
China     905.0  7813.0  0.396767  0.538817
GB       2895.0  5056.0  0.419195  0.685220
Korea     235.0  5192.0  0.186260  0.345561
US        144.0  4225.0  0.204452  0.878117

In [26]:
# 연도별(index) 국가별(column) 대륙별(column) pop, gdp
df.pivot(index='year', columns=['country', 'continent'], values=['pop', 'gdp'])

              pop                  ...       gdp
country     Korea   China      GB  ...     China        GB        US
continent    Asia    Asia  Europe  ...      Asia    Europe   America
year                               ...
2020        235.0   905.0  2895.0  ...  0.396767  0.419195  0.204452
2021       5192.0  7813.0  5056.0  ...  0.538817  0.685220  0.878117

[2 rows x 8 columns]

In [27]:
# 연도별 대륙별 국가별 pop, gdp
df.pivot(index='year', columns=['continent', 'country'], values=['pop', 'gdp'])

              pop                  ...       gdp
continent    Asia          Europe  ...      Asia    Europe   America
country     Korea   China      GB  ...     China        GB        US
year                               ...
2020        235.0   905.0  2895.0  ...  0.396767  0.419195  0.204452
2021       5192.0  7813.0  5056.0  ...  0.538817  0.685220  0.878117

[2 rows x 8 columns]

In [29]:
df = pd.DataFrame(data={'gender': ['Male', 'Female'] * 3,
                        'time': ['Lunch'] * 3 + ['Dinner'] * 3,
                        'day': ['Fri', 'Sat', 'Sun'] * 2,
                        'bill': np.arange(10, 70, 10),
                        'tip': np.arange(1, 7)})
df

   gender    time  day  bill  tip
0    Male   Lunch  Fri    10    1
1  Female   Lunch  Sat    20    2
2    Male   Lunch  Sun    30    3
3  Female  Dinner  Fri    40    4
4    Male  Dinner  Sat    50    5
5  Female  Dinner  Sun    60    6

In [31]:
# df.pivot(index='gender', columns='time', values='bill')
#> ValueError 발생: pivot 테이블의 셀의 개수가 values들의 개수보다 작기 때문에 에러 발생.

In [32]:
df.pivot(index='gender', columns='day', values='bill')

day     Fri  Sat  Sun
gender
Female   40   20   60
Male     10   50   30